       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID.  coboltut.
AUTHOR. Thomas Bivins. 
INSTALLATION. COBOL DEVELOPMENT CENTER. 
DATE-WRITTEN. 10/24/22. 
DATE-COMPILED. 01/01/08. 
SECURITY. NON-CONFIDENTIAL.
ENVIRONMENT DIVISION. 
       
DATA DIVISION. 
FILE SECTION. 
WORKING-STORAGE SECTION. 
01 UserName PIC X(30) VALUE "You".
01 Num1 PIC 9 VALUE ZEROS.
01 Num2 PIC 9 VALUE ZEROS.
01 Total PIC 99 VALUE 0.
01 SSNum.
       02 SSArea PIC 999.
       02 SSGroup PIC 99.
       02 SSSerial PIC 9999.
      

       PROCEDURE DIVISION.
      *****************************************************************